cncf/apisnoop/ci.org
#+TITLE: apisnoop/ci for per branch instances
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: 8th of March, 2019
#+PROPERTY: header-args:shell :results output code verbatim replace
#+PROPERTY: header-args:shell+ :exports both
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE :noeval t"
#+NOPROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (concat (user-login-name) ":" (nth 4 (org-heading-components)))
#+PROPERTY: header-args:shell+ :eval no-export
#+PROPERTY: header-args:tmate+ :eval no-export
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+STARTUP: content

* Overview

Our software developers needed to work on multiple issues / branches at the same
time. We needed to be able to compare different data generation methods and
visualizations. We have explored a few options (static sites via netflify, and various CI providers),
but feel our workflow with GitLab worth sharing.

** Using a review/BRANCH deployment

- [X] Create a PR
- [X] Wait for @cncf-ci to respond with your pipeline results
- [X] Inspect Pipeline logs and visit deployment url

* Mirror => Pipelines => Jobs => Environments

Mirroring from our repo to a CI Only gitlab project:

- [[https://gitlab.ii.coop/apisnoop/ci/settings/repository][settings/repository/mirroring]]

Each commit on a branch triggers a pipeline, and a set of jobs:

- [[https://gitlab.ii.coop/apisnoop/ci/branches][branches]] => [[https://gitlab.ii.coop/apisnoop/ci/pipelines][pipelines]] => [[https://gitlab.ii.coop/apisnoop/ci/-/jobs][jobs]]

The deploy jobs create environments per branch:

- [[https://gitlab.ii.coop/apisnoop/ci/environments][environments]] => [[https://gitlab.ii.coop/apisnoop/ci/environments/folders/review][review/*branch*]]

** example  

Example commit pipeline to deploy

- [[https://gitlab.ii.coop/apisnoop/ci/commit/eccfa3ce17d457754ee1d544910aeea22d2af600][UAFilter-commit]] 
- [[https://gitlab.ii.coop/apisnoop/ci/pipelines/281][pipeline#281]] 
- [[https://gitlab.ii.coop/apisnoop/ci/-/jobs/1871][build]] and [[https://gitlab.ii.coop/apisnoop/ci/-/jobs/1872][deploy]]  jobs
- [[https://gitlab.ii.coop/apisnoop/ci/environments/42][environment]]
- [[https://gitlab.ii.coop/apisnoop/ci/environments/42/terminal][console]]
- [[https://apisnoop-ci-review-tix-121-ltf42v.apisnoop.cncf.ci/][apisnoop-ci-review-BRANCHNAME.apisnoop.cncf.ci]]

* Kubernetes Cluster Overview
  
[[https://gitlab.ii.coop/apisnoop/ci/clusters/23]]

** namespaces

Jobs running in the ~gitlab-managed-apps~ namespace created/manage the
~apisnoop-ci~ namespace.
   
#+NAME: namespaces
#+BEGIN_SRC shell
  kubectl get namespaces
#+END_SRC

#+RESULTS: namespaces
#+BEGIN_EXAMPLE :noeval t
NAME                  STATUS   AGE
apisnoop-ci           Active   1d
default               Active   11d
gitlab-managed-apps   Active   11d
kube-public           Active   11d
kube-system           Active   11d
openfisca-aotearoa    Active   7d
raputure              Active   7d
#+END_EXAMPLE

** gitlab-managed-apps namespace

The job runners and CI infrastructure not specific to our project run in the
~gitlab-managed-apps~ namespace.

#+NAME: runner / certmgr / ingress / prometheus pods
#+BEGIN_SRC shell
  kubectl --namespace=gitlab-managed-apps get pods | grep -v rror
#+END_SRC

#+RESULTS: runner / certmgr / ingress / prometheus pods
#+BEGIN_EXAMPLE :noeval t
NAME                                                     READY   STATUS    RESTARTS   AGE
certmanager-cert-manager-6c8cd9f9bf-kjjsq                1/1     Running   3          11d
ingress-nginx-ingress-controller-ff666c548-vgcjr         1/1     Running   0          11d
ingress-nginx-ingress-default-backend-6679dd498c-nqh7p   1/1     Running   0          11d
prometheus-kube-state-metrics-8668948654-6qj5m           1/1     Running   0          11d
prometheus-prometheus-server-746bb67956-dzxz9            2/2     Running   0          11d
runner-gitlab-runner-9df899f44-smgtx                     1/1     Running   0          11d
tiller-deploy-9768f6964-qtb9m                            1/1     Running   0          11d
#+END_EXAMPLE
*** everything
#+NAME: all gitlab-managed-app namespace k8s objects
#+BEGIN_SRC shell
  kubectl --namespace=gitlab-managed-apps get all | grep -v Error
#+END_SRC

#+RESULTS: all gitlab-managed-app namespace k8s objects
#+BEGIN_EXAMPLE :noeval t
NAME                                                         READY   STATUS    RESTARTS   AGE
pod/certmanager-cert-manager-6c8cd9f9bf-kjjsq                1/1     Running   3          11d
pod/ingress-nginx-ingress-controller-ff666c548-vgcjr         1/1     Running   0          11d
pod/ingress-nginx-ingress-default-backend-6679dd498c-nqh7p   1/1     Running   0          11d
pod/prometheus-kube-state-metrics-8668948654-6qj5m           1/1     Running   0          11d
pod/prometheus-prometheus-server-746bb67956-dzxz9            2/2     Running   0          11d
pod/runner-gitlab-runner-9df899f44-smgtx                     1/1     Running   0          11d
pod/tiller-deploy-9768f6964-qtb9m                            1/1     Running   0          11d
NAME                                             TYPE           CLUSTER-IP      EXTERNAL-IP    PORT(S)                      AGE
service/ingress-nginx-ingress-controller         LoadBalancer   10.15.251.145   35.244.71.53   80:32363/TCP,443:30587/TCP   11d
service/ingress-nginx-ingress-controller-stats   ClusterIP      10.15.240.235   <none>         18080/TCP                    11d
service/ingress-nginx-ingress-default-backend    ClusterIP      10.15.243.113   <none>         80/TCP                       11d
service/prometheus-kube-state-metrics            ClusterIP      None            <none>         80/TCP                       11d
service/prometheus-prometheus-server             ClusterIP      10.15.254.80    <none>         80/TCP                       11d
service/tiller-deploy                            ClusterIP      10.15.253.242   <none>         44134/TCP                    11d
NAME                                                    DESIRED   CURRENT   UP-TO-DATE   AVAILABLE   AGE
deployment.apps/certmanager-cert-manager                1         1         1            1           11d
deployment.apps/ingress-nginx-ingress-controller        1         1         1            1           11d
deployment.apps/ingress-nginx-ingress-default-backend   1         1         1            1           11d
deployment.apps/prometheus-kube-state-metrics           1         1         1            1           11d
deployment.apps/prometheus-prometheus-server            1         1         1            1           11d
deployment.apps/runner-gitlab-runner                    1         1         1            1           11d
deployment.apps/tiller-deploy                           1         1         1            1           11d
NAME                                                               DESIRED   CURRENT   READY   AGE
replicaset.apps/certmanager-cert-manager-6c8cd9f9bf                1         1         1       11d
replicaset.apps/ingress-nginx-ingress-controller-ff666c548         1         1         1       11d
replicaset.apps/ingress-nginx-ingress-default-backend-6679dd498c   1         1         1       11d
replicaset.apps/prometheus-kube-state-metrics-8668948654           1         1         1       11d
replicaset.apps/prometheus-prometheus-server-746bb67956            1         1         1       11d
replicaset.apps/runner-gitlab-runner-9df899f44                     1         1         1       11d
replicaset.apps/tiller-deploy-9768f6964                            1         1         1       11d
#+END_EXAMPLE

