cncf/apisnoop/ci.org
** our project namespace

Our ~apisnoop-ci~ namespace contains our deployments based on
environment/branches.

#+NAME: apisnoop-ci namespace
#+BEGIN_SRC shell
  kubectl --namespace=apisnoop-ci get all 
#+END_SRC

#+RESULTS: apisnoop-ci namespace
#+BEGIN_EXAMPLE :noeval t
NAME                                         READY   STATUS    RESTARTS   AGE
pod/cm-acme-http-solver-f7cz7                1/1     Running   0          15h
pod/cm-acme-http-solver-qb8lg                1/1     Running   0          13h
pod/production-fb874dbcc-h5z7s               1/1     Running   0          15h
pod/review-tix-121-ltf42v-7cfd94d94c-qcbmv   1/1     Running   0          12h
pod/staging-dccc64786-bhhhj                  1/1     Running   0          13h
NAME                                        TYPE        CLUSTER-IP      EXTERNAL-IP   PORT(S)          AGE
service/cm-acme-http-solver-b24bq           NodePort    10.15.252.244   <none>        8089:32093/TCP   15h
service/cm-acme-http-solver-qj9wq           NodePort    10.15.255.153   <none>        8089:32489/TCP   13h
service/production-auto-deploy              ClusterIP   10.15.246.231   <none>        5000/TCP         15h
service/review-tix-121-ltf42v-auto-deploy   ClusterIP   10.15.245.117   <none>        5000/TCP         14h
service/staging-auto-deploy                 ClusterIP   10.15.250.73    <none>        5000/TCP         21h
NAME                                    DESIRED   CURRENT   UP-TO-DATE   AVAILABLE   AGE
deployment.apps/production              1         1         1            1           15h
deployment.apps/review-tix-121-ltf42v   1         1         1            1           14h
deployment.apps/staging                 1         1         1            1           21h
NAME                                               DESIRED   CURRENT   READY   AGE
replicaset.apps/production-fb874dbcc               1         1         1       15h
replicaset.apps/review-tix-121-ltf42v-567ccfb9dc   0         0         0       12h
replicaset.apps/review-tix-121-ltf42v-588c574d9f   0         0         0       14h
replicaset.apps/review-tix-121-ltf42v-7cfd94d94c   1         1         1       12h
replicaset.apps/review-tix-121-ltf42v-8f4c798c6    0         0         0       13h
replicaset.apps/staging-56b4657fbd                 0         0         0       18h
replicaset.apps/staging-7d78c78465                 0         0         0       21h
replicaset.apps/staging-85df9ccbb9                 0         0         0       15h
replicaset.apps/staging-dccc64786                  1         1         1       13h
#+END_EXAMPLE

** project pods

#+NAME: apisnoop-ci pods
#+BEGIN_SRC shell
  kubectl --namespace=apisnoop-ci get pods 
#+END_SRC

#+RESULTS: apisnoop-ci pods
#+BEGIN_EXAMPLE :noeval t
NAME                                     READY   STATUS    RESTARTS   AGE
cm-acme-http-solver-f7cz7                1/1     Running   0          18h
cm-acme-http-solver-qb8lg                1/1     Running   0          16h
production-fb874dbcc-h5z7s               1/1     Running   0          18h
review-tix-121-ltf42v-7cfd94d94c-qcbmv   1/1     Running   0          15h
staging-dccc64786-bhhhj                  1/1     Running   0          16h
#+END_EXAMPLE
*** current review pod
#+NAME review pod
#+BEGIN_SRC shell
kubectl describe --namespace=apisnoop-ci pod/review-tix-121-ltf42v-7cfd94d94c-qcbmv
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE :noeval t
Name:               review-download-f-5nlwri-688f86cc9c-vk22s
Namespace:          apisnoop-ci
Priority:           0
PriorityClassName:  <none>
Node:               gke-apisnoop-ci-default-pool-3fb18c85-whd7/10.152.0.13
Start Time:         Tue, 26 Mar 2019 09:44:28 +1300
Labels:             app=review-download-f-5nlwri
                    pod-template-hash=2449427757
                    release=review-download-f-5nlwri
                    tier=web
                    track=stable
Annotations:        checksum/application-secrets: 
Status:             Pending
IP:                 
Controlled By:      ReplicaSet/review-download-f-5nlwri-688f86cc9c
Containers:
  auto-deploy-app:
    Container ID:   
    Image:          registry.ii.coop/apisnoop/ci/download-fix:50db9d03ac86e85a5f5dcf1d5a6a11a7ce65c16d
    Image ID:       
    Port:           5000/TCP
    Host Port:      0/TCP
    State:          Waiting
      Reason:       ContainerCreating
    Ready:          False
    Restart Count:  0
    Liveness:       http-get http://:5000/ delay=15s timeout=15s period=10s #success=1 #failure=3
    Readiness:      http-get http://:5000/ delay=5s timeout=3s period=10s #success=1 #failure=3
    Environment Variables from:
      review-download-f-5nlwri-secret  Secret  Optional: false
    Environment:
      DATABASE_URL:  postgres://user:testing-password@review-download-f-5nlwri-postgres:5432/review-download-f-5nlwri
    Mounts:
      /var/run/secrets/kubernetes.io/serviceaccount from default-token-xsmbr (ro)
Conditions:
  Type              Status
  Initialized       True 
  Ready             False 
  ContainersReady   False 
  PodScheduled      True 
Volumes:
  default-token-xsmbr:
    Type:        Secret (a volume populated by a Secret)
    SecretName:  default-token-xsmbr
    Optional:    false
QoS Class:       BestEffort
Node-Selectors:  <none>
Tolerations:     node.kubernetes.io/not-ready:NoExecute for 300s
                 node.kubernetes.io/unreachable:NoExecute for 300s
Events:
  Type    Reason     Age    From                                                 Message
  ----    ------     ----   ----                                                 -------
  Normal  Scheduled  5m1s   default-scheduler                                    Successfully assigned apisnoop-ci/review-download-f-5nlwri-688f86cc9c-vk22s to gke-apisnoop-ci-default-pool-3fb18c85-whd7
  Normal  Pulling    4m57s  kubelet, gke-apisnoop-ci-default-pool-3fb18c85-whd7  pulling image "registry.ii.coop/apisnoop/ci/download-fix:50db9d03ac86e85a5f5dcf1d5a6a11a7ce65c16d"
#+END_EXAMPLE

* Digging into an environment / deployment

- Production, Staging, Review/Branch
[[https://gitlab.ii.coop/apisnoop/ci/environments]]
- Focus on Review/Branch
[[https://gitlab.ii.coop/apisnoop/ci/environments/folders/review]]
- Choose your environment, rollback to prior deployments if need be
[[https://gitlab.ii.coop/apisnoop/ci/environments/42]]
- If you been designated access, you can get a shell
[[https://gitlab.ii.coop/apisnoop/ci/environments/42/terminal]]

** gitlab environments => k8s deployments

#+NAME: apisnoop-ci deployments
#+BEGIN_SRC shell
  kubectl --namespace=apisnoop-ci get deployments
#+END_SRC

#+RESULTS: apisnoop-ci deployments
#+BEGIN_EXAMPLE :noeval t
NAME                    DESIRED   CURRENT   UP-TO-DATE   AVAILABLE   AGE
production              1         1         1            1           15h
review-tix-121-ltf42v   1         1         1            1           15h
staging                 1         1         1            1           21h
#+END_EXAMPLE

** gitlab environment => pod
   
#+NAME: review pod
#+BEGIN_SRC shell
  kubectl --namespace=apisnoop-ci get pods -o=name | grep review
#+END_SRC

#+RESULTS: review pod
#+BEGIN_EXAMPLE :noeval t
pod/review-tix-121-ltf42v-7cfd94d94c-qcbmv
#+END_EXAMPLE

*** executing commands / listing data within pod

#+NAME: commands inside deploy container
#+BEGIN_SRC shell
  kubectl --namespace=apisnoop-ci exec \
      review-tix-121-ltf42v-7cfd94d94c-qcbmv \
      -- \
     find /app/data-gen/processed/ -name apisnoop.json
#+END_SRC

#+RESULTS: commands inside deploy container
#+BEGIN_EXAMPLE :noeval t
/app/data-gen/processed/ci-kubernetes-e2e-gce-cos-k8sstable2-default/2010/apisnoop.json
/app/data-gen/processed/ci-kubernetes-e2e-gce-cos-k8sstable1-default/5953/apisnoop.json
/app/data-gen/processed/ci-kubernetes-e2e-gci-gce/36092/apisnoop.json
/app/data-gen/processed/ci-kubernetes-e2e-gce-cos-k8sbeta-default/10141/apisnoop.json
/app/data-gen/processed/ci-kubernetes-e2e-gce-cos-k8sstable3-default/507/apisnoop.json
#+END_EXAMPLE

