cncf/apisnoop/ci.md

### review pod details<a id="sec-3-2-2"></a>

```shell
kubectl --namespace=apisnoop-ci describe pod/review-tix-121-ltf42v-7cfd94d94c-qcbmv
```

    Name:               review-tix-121-ltf42v-7cfd94d94c-qcbmv
    Namespace:          apisnoop-ci
    Priority:           0
    PriorityClassName:  <none>
    Node:               gke-apisnoop-ci-default-pool-3fb18c85-whd7/10.152.0.13
    Start Time:         Tue, 26 Mar 2019 16:27:03 +1300
    Labels:             app=review-tix-121-ltf42v
                        pod-template-hash=3798508507
                        release=review-tix-121-ltf42v
                        tier=web
                        track=stable
    Annotations:        checksum/application-secrets: 
    Status:             Running
    IP:                 10.12.0.63
    Controlled By:      ReplicaSet/review-tix-121-ltf42v-7cfd94d94c
    Containers:
      auto-deploy-app:
        Container ID:   docker://ed96e9bf14e98d0209eddf37441cc6247bbdb7fa8bb2f276a40a2dcf952c0526
        Image:          registry.ii.coop/apisnoop/ci/tix-121:eccfa3ce17d457754ee1d544910aeea22d2af600
        Image ID:       docker-pullable://registry.ii.coop/apisnoop/ci/tix-121@sha256:e5d9f126cbd605b8ddbdda0d302205fc8fdd1383c4c2c7af177960e1f3d77e1f
        Port:           5000/TCP
        Host Port:      0/TCP
        State:          Running
          Started:      Tue, 26 Mar 2019 16:31:55 +1300
        Ready:          True
        Restart Count:  0
        Liveness:       http-get http://:5000/ delay=15s timeout=15s period=10s #success=1 #failure=3
        Readiness:      http-get http://:5000/ delay=5s timeout=3s period=10s #success=1 #failure=3
        Environment Variables from:
          review-tix-121-ltf42v-secret  Secret  Optional: false
        Environment:
          DATABASE_URL:  postgres://user:testing-password@review-tix-121-ltf42v-postgres:5432/review-tix-121-ltf42v
        Mounts:
          /var/run/secrets/kubernetes.io/serviceaccount from default-token-xsmbr (ro)
    Conditions:
      Type              Status
      Initialized       True 
      Ready             True 
      ContainersReady   True 
      PodScheduled      True 
    Volumes:
      default-token-xsmbr:
        Type:        Secret (a volume populated by a Secret)
        SecretName:  default-token-xsmbr
        Optional:    false
    QoS Class:       BestEffort
    Node-Selectors:  <none>
    Tolerations:     node.kubernetes.io/not-ready:NoExecute for 300s
                     node.kubernetes.io/unreachable:NoExecute for 300s
    Events:          <none>

## kubectl exec shell<a id="sec-3-3"></a>

```tmate
kubectl --namespace=apisnoop-ci exec -ti \
      review-tix-121-ltf42v-7cfd94d94c-qcbmv \
      /bin/bash
```

```tmate
cd /app/data-gen/processed
```

# Debugging a build<a id="sec-4"></a>

## retrieving the trace<a id="sec-4-1"></a>

These files look to be in the wrong location:

<https://gitlab.ii.coop/apisnoop/ci/-/jobs/1802>

The herokuish runs against a dind:

```shell
export DOCKER_HOST=tcp://localhost:2375
docker exec -ti ci_job_build_1802 /bin/bash
```

```shell
. .env
curl --header "PRIVATE-TOKEN: $GITLAB_PRIVATE_TOKEN" "https://gitlab.ii.coop/api/v4/projects/apisnoop%2Fci/jobs/1802/trace"
```

For some reason it's showing we aren't logged into the namespace

<https://gitlab.ii.coop/apisnoop/ci/-/jobs/1786>

```shell
. .env
curl --header "PRIVATE-TOKEN: $GITLAB_PRIVATE_TOKEN" "https://gitlab.ii.coop/api/v4/projects/apisnoop%2Fci/jobs/1786/trace" \
| grep -A2 ensure_namespace
```

    [32;1m$ ensure_namespace[0;m
    error: You must be logged in to the server (Unauthorized)
    error: You must be logged in to the server (Unauthorized)

## build container<a id="sec-4-2"></a>

```shell
kubectl --namespace=gitlab-managed-apps get pods | grep 142 | awk '{print $1}'
```

    runner-zf8zf8jb-project-142-concurrent-02pzqk

```shell
(
  kubectl --namespace=gitlab-managed-apps logs \
        runner-zf8zf8jb-project-142-concurrent-02pzqk \
          -c build
) 2>&1
:
```

    

```tmate
kubectl --namespace=gitlab-managed-apps exec -ti \
        runner-zf8zf8jb-project-142-concurrent-02pzqk \
        -c build /bin/sh
```

We need to choose a specific container:

    Error from server (BadRequest):
    a container name must be specified for pod runner-zf8zf8jb-project-142-concurrent-0csdmb,
     choose one of: [build helper svc-0]

## repository image<a id="sec-4-3"></a>

The build job log will contain the registry + tag the image was pushed to.

    Configuring registry.ii.coop/apisnoop/ci/master:c2351d87cc36f0a1ef117c4caff3851312d514e6 docker image...

If you want to poke around the resulting image you can run the following:

```shell
docker pull registry.ii.coop/apisnoop/ci/master:c2351d87cc36f0a1ef117c4caff3851312d514e6
```

# TIL<a id="sec-5"></a>

Delete Environments

```shell
. .env
curl --request DELETE --header "PRIVATE-TOKEN: $GITLAB_PRIVATE_TOKEN" \
  "https://gitlab.ii.coop/api/v4/projects/142/environments/40"
```

## retreving cluster creds<a id="sec-5-1"></a>

```shell
kubectl config view --merge --minify --flatten \
| grep -v access-token
```

```yaml
apiVersion: v1
clusters:
- cluster:
    certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURDekNDQWZPZ0F3SUJBZ0lRT0J3VEwvck15ZWNDczRyTFk5WTRRVEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSbU9UUm1OelZoTnkxa04yWmtMVFJoTURrdE9UYzBZeTAyT0RGa01qVTBOR0pqTWpjdwpIaGNOTVRrd016RTFNVFl4TWpBMFdoY05NalF3TXpFek1UY3hNakEwV2pBdk1TMHdLd1lEVlFRREV5Um1PVFJtCk56VmhOeTFrTjJaa0xUUmhNRGt0T1RjMFl5MDJPREZrTWpVME5HSmpNamN3Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUURBWnJIeUllbnBDUERZcmdmTjFYNFd0NmYvUTF1K2doUm5OTFdhaDBtaAp5L29YdDJtQmk4VWU2anpQeXJzdkRWd3FpSGVrMkoxTjJOT0hKWW1RQjdiRCs1ekVERWVaQnc5b2dBcWI3REtFClNVUCtsaE5FTGhTYUF0dHpRVzBEUjdPUlRlRmp0V0pJejNZZmg4dVlMMy9kTWFCa0xMNHlNMjhPb0YyRjN2YzcKL1dLUmdsNDUvd2VleUwvc0NjVmQwYW50R1BlUDZJNXRyRC9kRVZpRUo2UWkzYzlIU01CTkE0MFFBcTRuSFpZZAozV01QWkhoRmNKZ2hTTjZxZmVkMUdzc25XdmFMWGNBL2VlVUowVVI0ZnFkTUJVQU5zd0VTS1lLQTg4M1ZNczdJCjUrZHljdHFPbUcvd29LUUJzcFpDcHI3RXJybDlTcktOUHJXNDlTRXF4eU9oQWdNQkFBR2pJekFoTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFCdgoybzZqQ285TDcyZFllSUFCS1JsQlAxQU9VdzcrOXFtYjV0Y0JyTU11aW5pOEc1Y1lzaDRzUXNGZnZERVNMaldnCmFBSU1uVHEySm4yUnZOUTVJdkhZNllVU3k3MXh3bndBUnhGN2wyVHptVUZ3NFhlVG0xWTMzakFobmhnNE5GNWgKblRoek4wc2dSbVJrRzkwL1BuTUdTYkpYTzFob0pTL1ViWTVsbkU2ak93WFlWNnVTREM4cE41dHZ4MTlSWS9JVQo5TlBKRUp5a2I4VWF3WWIzS2pzV1JVdXBJTVprKzNIZ1lrT3lsbzE5SU9IRzdyTTNQV2pMbngrSTdGRlk3OXM1CnA1K3RUWUhhbDdyVEpIQTN1dFdzODJRc1J0RE9XbFczN0JKcEk5VWRCb1U3UmJYR3Z0VjcrV1NEM0dnbTNrZ20Kd2NiTEx2eUhWbnMycjRiWU9mbmoKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
    server: https://35.201.3.241
  name: gke_apisnoop_australia-southeast1-c_apisnoop-ci
contexts:
- context:
    cluster: gke_apisnoop_australia-southeast1-c_apisnoop-ci
    user: gke_apisnoop_australia-southeast1-c_apisnoop-ci
  name: gke_apisnoop_australia-southeast1-c_apisnoop-ci
current-context: gke_apisnoop_australia-southeast1-c_apisnoop-ci
kind: Config
preferences: {}
users:
- name: gke_apisnoop_australia-southeast1-c_apisnoop-ci
  user:
    auth-provider:
      config:
        cmd-args: config config-helper --format=json
        cmd-path: /usr/lib/google-cloud-sdk/bin/gcloud
        expiry: "2019-03-26T16:41:26Z"
        expiry-key: '{.credential.token_expiry}'
        token-key: '{.credential.access_token}'
      name: gcp
```
