cncf/apisnoop/ci.md

## retreiving a job trace<a id="sec-5-2"></a>

<https://docs.gitlab.com/ee/api/jobs.html#get-a-trace-file> <https://docs.gitlab.com/ee/api/README.html#namespaced-path-encoding>

```shell
. .env
curl --header "PRIVATE-TOKEN: $GITLAB_PRIVATE_TOKEN" "https://gitlab.ii.coop/api/v4/projects/apisnoop%2Fci/jobs/1786/trace"
```

## retrieving a job ENV<a id="sec-5-3"></a>

We inspect the environment of pid 1 and use grep to sort it nicely

```shell
kubectl --namespace=gitlab-managed-apps exec -ti \
 runner-zf8zf8jb-project-142-concurrent-0dl4pg \
 -c build -- /bin/sh -c \
 'cat /proc/1/environ | grep =' | sort
```

    AUTO_DEVOPS_DOMAIN=apisnoop.cncf.ci
    CI_API_V4_URL=https://gitlab.ii.coop/api/v4
    CI_BUILD_BEFORE_SHA=ef143bd7e1583068b78cb2cf8d3be16d270e1cb4
    CI_BUILD_ID=1795
    CI_BUILD_NAME=review
    CI_BUILD_REF=1caf563c3cba6336036f867ae2d85fa4ee345718
    CI_BUILD_REF_NAME=gitlab-ci.yaml
    CI_BUILD_REF_SLUG=gitlab-ci-yaml
    CI_BUILD_STAGE=review
    CI_COMMIT_BEFORE_SHA=ef143bd7e1583068b78cb2cf8d3be16d270e1cb4
    CI_COMMIT_DESCRIPTION=
    CI_COMMIT_MESSAGE=Debugging .gitlab-ci.yml
    CI_COMMIT_REF_NAME=gitlab-ci.yaml
    CI_COMMIT_REF_SLUG=gitlab-ci-yaml
    CI_COMMIT_SHA=1caf563c3cba6336036f867ae2d85fa4ee345718
    CI_COMMIT_SHORT_SHA=1caf563c
    CI_COMMIT_TITLE=Debugging .gitlab-ci.yml
    CI_CONFIG_PATH=.gitlab-ci.yml
    CI_DISPOSABLE_ENVIRONMENT=true
    CI_ENVIRONMENT_NAME=review/gitlab-ci.yaml
    CI_ENVIRONMENT_SLUG=review-gitlab-ci-3s76v0
    CI_ENVIRONMENT_URL=http://apisnoop-ci-review-gitlab-ci-3s76v0.apisnoop.cncf.ci
    CI_JOB_ID=1795
    CI_JOB_NAME=review
    CI_JOB_STAGE=review
    CI_JOB_URL=https://gitlab.ii.coop/apisnoop/ci/-/jobs/1795
    CI_NODE_TOTAL=1
    CI_PIPELINE_ID=262
    CI_PIPELINE_IID=48
    CI_PIPELINE_SOURCE=push
    CI_PIPELINE_URL=https://gitlab.ii.coop/apisnoop/ci/pipelines/262
    CI_PROJECT_DIR=/apisnoop/ci
    CI_PROJECT_ID=142
    CI_PROJECT_NAME=ci
    CI_PROJECT_NAMESPACE=apisnoop
    CI_PROJECT_PATH=apisnoop/ci
    CI_PROJECT_PATH_SLUG=apisnoop-ci
    CI_PROJECT_URL=https://gitlab.ii.coop/apisnoop/ci
    CI_PROJECT_VISIBILITY=public
    CI_REGISTRY_IMAGE=registry.ii.coop/apisnoop/ci
    CI_REGISTRY=registry.ii.coop
    CI_REGISTRY_USER=gitlab-ci-token
    CI_RUNNER_DESCRIPTION=
    CI_RUNNER_EXECUTABLE_ARCH=linux/amd64
    CI_RUNNER_ID=6
    CI_RUNNER_REVISION=f100a208
    CI_RUNNER_TAGS=cluster, kubernetes
    CI_RUNNER_VERSION=11.6.0
    CI_SERVER_NAME=GitLab
    CI_SERVER_REVISION=ed04633
    CI_SERVER_TLS_CA_FILE=-----BEGIN CERTIFICATE-----
    CI_SERVER_VERSION=11.7.5-ee
    CI_SERVER_VERSION_MAJOR=11
    CI_SERVER_VERSION_MINOR=7
    CI_SERVER_VERSION_PATCH=5
    CI_SERVER=yes
    CI=true
    DOCKER_DRIVER=overlay2
    FF_K8S_USE_ENTRYPOINT_OVER_COMMAND=true
    GITLAB_CI=true
    GITLAB_FEATURES=audit_events,burndown_charts,code_owners,contribution_analytics,elastic_search,export_issues,group_burndown_charts,group_webhooks,issuable_default_templates,issue_board_focus_mode,issue_weights,jenkins_integration,ldap_group_sync,member_lock,merge_request_approvers,multiple_ldap_servers,multiple_issue_assignees,multiple_project_issue_boards,push_rules,project_creation_level,protected_refs_for_users,related_issues,repository_mirrors,repository_size_limit,scoped_issue_board,admin_audit_log,auditor_user,board_assignee_lists,board_milestone_lists,cross_project_pipelines,custom_file_templates,custom_file_templates_for_namespace,email_additional_text,db_load_balancing,deploy_board,extended_audit_events,file_locks,geo,github_project_service_integration,jira_dev_panel_integration,ldap_group_sync_filter,multiple_clusters,multiple_group_issue_boards,merge_request_performance_metrics,object_storage,group_saml,service_desk,smartcard_auth,unprotection_restrictions,variable_environment_scope,reject_unsigned_commits,commit_committer_check,external_authorization_service,ci_cd_projects,protected_environments,system_header_footer,custom_project_templates,packages,code_owner_as_approver_suggestion,feature_flags,batch_comments,issues_analytics,security_dashboard,dependency_scanning,license_management,sast,sast_container,container_scanning,cluster_health,dast,epics,chatops,pod_logs,pseudonymizer,prometheus_alerts,operations_dashboard,tracing,web_ide_terminal
    GITLAB_USER_EMAIL=hh@ii.coop
    GITLAB_USER_ID=2
    GITLAB_USER_LOGIN=hh
    GITLAB_USER_NAME=Hippie Hacker
    HELM_VERSION=2.11.0
    HOME=/root
    HOSTNAME=runner-zf8zf8jb-project-142-concurrent-0dl4pg
    INCREMENTAL_ROLLOUT_ENABLED=1
    INCREMENTAL_ROLLOUT_MODE=manual
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_443_TCP_ADDR=10.15.251.145
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_443_TCP_PORT=443
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_443_TCP_PROTO=tcp
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_443_TCP=tcp://10.15.251.145:443
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_80_TCP_ADDR=10.15.251.145
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_80_TCP_PORT=80
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_80_TCP_PROTO=tcp
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT_80_TCP=tcp://10.15.251.145:80
    INGRESS_NGINX_INGRESS_CONTROLLER_PORT=tcp://10.15.251.145:80
    INGRESS_NGINX_INGRESS_CONTROLLER_SERVICE_HOST=10.15.251.145
    INGRESS_NGINX_INGRESS_CONTROLLER_SERVICE_PORT=80
    INGRESS_NGINX_INGRESS_CONTROLLER_SERVICE_PORT_HTTP=80
    INGRESS_NGINX_INGRESS_CONTROLLER_SERVICE_PORT_HTTPS=443
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_PORT_18080_TCP_ADDR=10.15.240.235
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_PORT_18080_TCP_PORT=18080
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_PORT_18080_TCP_PROTO=tcp
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_PORT_18080_TCP=tcp://10.15.240.235:18080
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_PORT=tcp://10.15.240.235:18080
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_SERVICE_HOST=10.15.240.235
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_SERVICE_PORT=18080
    INGRESS_NGINX_INGRESS_CONTROLLER_STATS_SERVICE_PORT_STATS=18080
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_PORT_80_TCP_ADDR=10.15.243.113
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_PORT_80_TCP_PORT=80
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_PORT_80_TCP_PROTO=tcp
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_PORT_80_TCP=tcp://10.15.243.113:80
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_PORT=tcp://10.15.243.113:80
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_SERVICE_HOST=10.15.243.113
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_SERVICE_PORT=80
    INGRESS_NGINX_INGRESS_DEFAULT_BACKEND_SERVICE_PORT_HTTP=80
    KOqkqm57TH2H3eDJAkSnh6/DNFu0Qg==
    KUBE_CA_PEM=-----BEGIN CERTIFICATE-----
    KUBE_CA_PEM_FILE=-----BEGIN CERTIFICATE-----
    KUBE_NAMESPACE=ci-142
    KUBERNETES_PORT_443_TCP_ADDR=10.15.240.1
    KUBERNETES_PORT_443_TCP_PORT=443
    KUBERNETES_PORT_443_TCP_PROTO=tcp
    KUBERNETES_PORT_443_TCP=tcp://10.15.240.1:443
    KUBERNETES_PORT=tcp://10.15.240.1:443
    KUBERNETES_SERVICE_HOST=10.15.240.1
    KUBERNETES_SERVICE_PORT=443
    KUBERNETES_SERVICE_PORT_HTTPS=443
    KUBERNETES_VERSION=1.10.9
    KUBE_SERVICE_ACCOUNT=ci-142-service-account
    KUBE_URL=https://35.201.3.241
    PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin
    POSTGRES_DB=review-gitlab-ci-3s76v0
    POSTGRES_ENABLED=true
    POSTGRES_PASSWORD=testing-password
    POSTGRES_USER=user
    PROMETHEUS_PROMETHEUS_SERVER_PORT_80_TCP_ADDR=10.15.254.80
    PROMETHEUS_PROMETHEUS_SERVER_PORT_80_TCP_PORT=80
    PROMETHEUS_PROMETHEUS_SERVER_PORT_80_TCP_PROTO=tcp
    PROMETHEUS_PROMETHEUS_SERVER_PORT_80_TCP=tcp://10.15.254.80:80
    PROMETHEUS_PROMETHEUS_SERVER_PORT=tcp://10.15.254.80:80
    PROMETHEUS_PROMETHEUS_SERVER_SERVICE_HOST=10.15.254.80
    PROMETHEUS_PROMETHEUS_SERVER_SERVICE_PORT=80
    PROMETHEUS_PROMETHEUS_SERVER_SERVICE_PORT_HTTP=80
    PWD=/
    SHLVL=1
    STAGING_ENABLED=1
    TILLER_DEPLOY_PORT_44134_TCP_ADDR=10.15.253.242
    TILLER_DEPLOY_PORT_44134_TCP_PORT=44134
    TILLER_DEPLOY_PORT_44134_TCP_PROTO=tcp
    TILLER_DEPLOY_PORT_44134_TCP=tcp://10.15.253.242:44134
    TILLER_DEPLOY_PORT=tcp://10.15.253.242:44134
    TILLER_DEPLOY_SERVICE_HOST=10.15.253.242
    TILLER_DEPLOY_SERVICE_PORT=44134
    TILLER_DEPLOY_SERVICE_PORT_TILLER=44134
