cncf/apisnoop/ci.org
** run kubectl commands within deploy job

I deleted the namespace, and apparently that was bad.

We wrap it in () and redirect stderr '2>&1' followed by : to ensure output
staging-7d78c78465-w628j 
#+NAME: attemp to run a kubectl command
#+BEGIN_SRC shell
  (
      kubectl --namespace=gitlab-managed-apps exec \
          runner-zf8zf8jb-project-142-concurrent-0dl4pg \
          -c build -- \
          kubectl get namespaces
  ) 2>&1
  :
#+END_SRC

#+RESULTS: failed attempt to run a kubectl command
#+BEGIN_EXAMPLE :noeval t
Error from server (Forbidden): namespaces is forbidden: User "system:serviceaccount:gitlab-managed-apps:default" cannot list namespaces at the cluster scope
command terminated with exit code 1
#+END_EXAMPLE
* [0/1] Future Features
- [ ] gitlab should provide the kubectl exec command to get a shell on a pod / container combo for a deploy
- [ ] gitlab should provide links to line numbers in job output
* Footnotes

# Local Variables:
# eval: (set (make-local-variable 'org-file-dir) (file-name-directory buffer-file-name))
# eval: (set (make-local-variable 'user-buffer) (concat user-login-name "." (file-name-base buffer-file-name)))
# eval: (set (make-local-variable 'tmpdir) (make-temp-file (concat "/dev/shm/" user-buffer "-") t))
# eval: (set (make-local-variable 'socket) (concat "/tmp/" user-buffer ".iisocket"))
# eval: (set (make-local-variable 'select-enable-clipboard) t)
# eval: (set (make-local-variable 'select-enable-primary) t)
# noeval: (set (make-local-variable 'start-tmate-command) (concat "tmate -S " socket " new-session -A -s " user-login-name " -n main \"tmate wait tmate-ready && tmate display -p '#{tmate_ssh}' | xclip -i -sel p -f | xclip -i -sel c; bash --login\""))
# eval: (xclip-mode 1) 
# eval: (gui-select-text start-tmate-command)
# eval: (xclip-mode 1) 
# org-babel-tmate-session-prefix: ""
# org-babel-tmate-default-window-name: "main"
# org-confirm-babel-evaluate: nil
# org-use-property-inheritance: t
# End:
