cncf/apisnoop/ci.md

## run kubectl commands within deploy job<a id="sec-5-4"></a>

I deleted the namespace, and apparently that was bad.

We wrap it in () and redirect stderr '2>&1' followed by : to ensure output staging-7d78c78465-w628j

```shell
(
    kubectl --namespace=gitlab-managed-apps exec \
        runner-zf8zf8jb-project-142-concurrent-0dl4pg \
        -c build -- \
        kubectl get namespaces
) 2>&1
:
```

    Error from server (Forbidden): namespaces is forbidden: User "system:serviceaccount:gitlab-managed-apps:default" cannot list namespaces at the cluster scope
    command terminated with exit code 1

# <code>[0/1]</code> Future Features<a id="sec-6"></a>

-   [ ] gitlab should provide the kubectl exec command to get a shell on a pod / container combo for a deploy
-   [ ] gitlab should provide links to line numbers in job output
